Процедура ПоддержкаWebSocketСоединений() Экспорт
	Клиент = ШлюзЦентраУведомлений.ПолучитьКлиент();
	Если Клиент.ПолучитьСостояниеСоединения() 
		= СостояниеWebSocketСоединения.Закрыто Тогда
		ШлюзЦентраУведомлений.ПолучитьКлиент().Подключить();
	КонецЕсли; Клиент = Неопределено;
КонецПроцедуры

Процедура РегламентДоставки(Канал) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Уведомления.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Уведомления КАК Уведомления
	               |ГДЕ
	               |	НЕ Уведомления.Проведен
	               |	И Не Уведомления.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Уведомления.Номер,
	               |	Уведомления.Дата";
	// ирОбщий.От(Запрос) - для отладки запроса в точке останова
	Для Каждого Запись Из Запрос.Выполнить().Выгрузить() Цикл
		Док = Запись.Ссылка;
		Если Ложь Тогда Док = Документы.Уведомления.ПустаяСсылка() КонецЕсли;
		
		ЗаблокироватьДанныеДляРедактирования(Док);
		Попытка
			Док = Док.ПолучитьОбъект();
			Если Не Док.Проведен Тогда
				Док.Записать(РежимЗаписиДокумента.Проведение
				, РежимПроведенияДокумента.Неоперативный);
			КонецЕсли;
		Исключение
			Док.Прочитать();
			Док.УстановитьПометкуУдаления(Истина);
		КонецПопытки;
		РазблокироватьДанныеДляРедактирования(Док.Ссылка);
		Док = Неопределено;
	КонецЦикла;
КонецПроцедуры
