Процедура ПриПолученииСообщения(Соединение, Сообщение)
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		
		Ответ = КоннекторHTTP.НовыйОтвет();
		Ответ.КодСостояния = 200;
		Ответ.Тело = ПолучитьДвоичныеДанныеИзСтроки(Сообщение);
		Ответ.Заголовки = Соединение.Параметры.Заголовки;
		
		Результат = КоннекторHTTP.КакJson(Ответ,
		ШлюзЦентраУведомлений.ПолучитьПараметрыHTTP(
		).ПараметрыПреобразованияJSON);		
		
		Если // обрабатываем только уведомления
			Результат.typ = Перечисления.ТипыПакетовСообщений.notify
			И Результат.payload.typ = Перечисления.ТипыСообщений.send Тогда
			
			Запрос = Новый Запрос;
			
			ХешСумма = Новый ХешированиеДанных(ХешФункция.CRC32);
			ХешСумма.Добавить(Результат.payload.mes);
			Запрос.Параметры.Вставить("КонтрольнаяСумма", ХешСумма.ХешСумма);
			ХешСумма = Неопределено;
			
			Запрос.Параметры.Вставить("Дата", ТекущаяДатаСеанса());
			Запрос.Параметры.Вставить("Идентификатор", Результат.uuid);
			Запрос.Параметры.Вставить("Тема", Результат.payload.top);
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПУ.Канал КАК Канал
			|ИЗ
			|	РегистрСведений.ПодпискиНаУведомления.СрезПоследних(&Дата,
			|		ИСТИНА
			|			И Подписка
			|			И Тема = &Тема) КАК ПУ
			|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Уведомления КАК УВ
			|	ПО ИСТИНА
			|		И ПУ.Тема = УВ.Тема
			|		И ПУ.Канал = УВ.Канал
			|		И УВ.Идентификатор = &Идентификатор
			|		И УВ.КонтрольнаяСумма = &КонтрольнаяСумма
			|ГДЕ УВ.Канал ЕСТЬ NULL
			|";
			ПсевдоИдентификатор = Документы.Уведомления.ПолучитьСсылку(Запрос.Параметры.Идентификатор);
			ЗаблокироватьДанныеДляРедактирования(ПсевдоИдентификатор);
			
			Каналы = Новый Соответствие;
			
			Для Каждого Канал Из Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Канал") Цикл
				
				ДК = Документы.Уведомления.СоздатьДокумент();
				ДК.Номер = Результат.ulid;
				ДК.Сообщение = Результат.payload.mes;
				ДК.Канал = Канал;
				ЗаполнитьЗначенияСвойств(ДК, Запрос.Параметры);
				ДК.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
				
				Канал.Вставить(ДК.Канал);
				
			КонецЦикла;
			РазблокироватьДанныеДляРедактирования(ПсевдоИдентификатор);
			
			Запрос = Новый Запрос;
			Запрос.Параметры.Вставить("Каналы");
			Для Каждого Канал Из Каналы Цикл    
				Запрос.Параметры.Вставить(Канал);
			КонецЦикла;
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Т1.Ссылка КАК Протокол
			|ИЗ
			|	Справочник.КаналыОтправкиУведомлений КАК Т2
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПротоколыОтправкиУведомлений КАК Т1
			|		ПО Т2.Владелец = Т1.Ссылка
			|ГДЕ
			|	Т2.Ссылка В(&Каналы)";   
			
			РегЗадания = Новый Соответствие;
			Для Каждого РегЗадание Из РегламентныеЗадания.ПолучитьРегламентныеЗадания() Цикл
				РегЗадания.Вставить(РегЗадание.Ключ,РегЗадание);
			КонецЦикла;
			
			Для Каждого Протокол Из Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0) Цикл
				РегЗадание = РегЗадания.Получить(Строка(Протокол.УникальныйИдентификатор()));
				Если РегЗадание = Неопределено Тогда
					ЗаписьЖурналаРегистрации("Уведомления.РегламентныеЗадания"
					,УровеньЖурналаРегистрации.Предупреждение
					, Протокол.Метаданные(),Протокол,"
					|Для протокола поступают уведомления,
					|но регламентное задание обработчика не найдено.
					|Возможно требуется создать <Регламентное задание> обработчика."
					, РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
				ИначеЕсли Не РегЗадание.Использование Тогда
					ЗаписьЖурналаРегистрации("Уведомления.РегламентныеЗадания"
					,УровеньЖурналаРегистрации.Предупреждение
					, Протокол.Метаданные(),Протокол,"
					|Для протокола поступают уведомления,
					|но регламентное задание обработчика отключено.
					|Возможно требуется включить <Регламентное задание> обработчика."
					, РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
				КонецЕсли;
			КонецЦикла;    
			
		КонецЕсли;
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ШлюзЦентраУведомлений.ОтправитьОшибку(Результат.uuid
		, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;	
КонецПроцедуры
