
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	#Если Не ТолстыйКлиентУправляемоеПриложение Тогда
		ВызватьИсключение "Работаю только в толстом клиенте";
	#Иначе
		Если Ложь Тогда ПараметрКоманды = Справочники.КаналыОтправкиУведомлений.ПустаяСсылка()КонецЕсли;
			ВнешниеПараметры = ОбработкаАлгоритмов.ПолучитьТаблицуПараметровАлгоримаФормированияСсылки(ПараметрКоманды);
			Если Ложь Тогда ВнешниеПараметры = Новый ТаблицаЗначений КонецЕсли;
			ВнешниеПараметры = ВнешниеПараметры.Скопировать(ВнешниеПараметры.НайтиСтроки(Новый Структура("Фиксированный",Истина)));

			Алгоритм = ПараметрКоманды.Владелец.АлгоритмФормированияСсылки;
			ЗаблокироватьДанныеДляРедактирования(Алгоритм,,ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор);
            Попытка
			СтруктураАлгоритма = Новый Структура("ТекстАлгоритма,ВнутренниеПараметры");
			СтруктураАлгоритма.ТекстАлгоритма = Алгоритм.ТекстАлгоритма;
			СтруктураАлгоритма.ВнутренниеПараметры = Алгоритм.Параметры;
			
			НаСервере = Истина;
			ИмяАлгоритма = Алгоритм.ПолноеНаименование();
			
			ОбработкаКонсольКода = ирОбщий.СоздатьОбъектПоИмениМетаданныхЛкс("Обработка.ирКонсольКода");
			ФормаКонсоли = ОбработкаКонсольКода.ПолучитьФорму();
			Если ВнешниеПараметры <> Неопределено Тогда
				КопияПараметров = ВнешниеПараметры.Скопировать();
				Если КопияПараметров.Колонки.Найти("ТаблицаТипов") = Неопределено Тогда
					КопияПараметров.Колонки.Добавить("ТаблицаТипов");
				КонецЕсли; 
				Если КопияПараметров.Колонки.Найти("Значение") = Неопределено Тогда
					КопияПараметров.Колонки.Добавить("Значение");
				КонецЕсли; 
				Если КопияПараметров.Колонки.Найти("Фиксированный") = Неопределено Тогда
					КопияПараметров.Колонки.Добавить("Фиксированный");
				КонецЕсли; 
				Для Каждого СтрокаПараметра Из КопияПараметров Цикл
					Если Истина
						И ТипЗнч(СтрокаПараметра.ТипЗначения) = Тип("ОписаниеТипов") 
						И СтрокаПараметра.ТаблицаТипов = Неопределено
						Тогда
						СтрокаПараметра.ТаблицаТипов = ирКэш.Получить().ТаблицаТиповИзОписанияТипов(СтрокаПараметра.ТипЗначения);
					КонецЕсли; 
				КонецЦикла;
				КопияПараметров.ЗаполнитьЗначения(Истина, "Фиксированный");
				ФормаКонсоли.мСписокВнешнихПараметров = КопияПараметров; 
			КонецЕсли; 
			Если СтруктураАлгоритма <> Неопределено Тогда
				Если СтруктураАлгоритма.Свойство("ТекстАлгоритма") Тогда
					ФормаКонсоли.ПараметрТекст = СтруктураАлгоритма.ТекстАлгоритма;
				КонецЕсли; 
				Если СтруктураАлгоритма.Свойство("ВнутренниеПараметры") Тогда
					ирОбщий.ЗагрузитьВТаблицуЗначенийЛкс(СтруктураАлгоритма.ВнутренниеПараметры, КопияПараметров);
					КопияПараметров.ЗаполнитьЗначения(Истина, "Вход");
				КонецЕсли; 
			КонецЕсли; 
			ФормаКонсоли.ПараметрНаСервере = НаСервере;
			ФормаКонсоли.мМетоды = Неопределено;
			ФормаКонсоли.мРежимРедактора = Истина;
			ФормаКонсоли.мИмяАлгоритмаДляРедактора = ИмяАлгоритма;
			ФормаКонсоли.ТекущийАлгоритм = Алгоритм;
			ФормаКонсоли.АвтоПараметрыВыхода = Ложь;
			ФормаКонсоли.АвтосохранениеФайлаВосстановления = Ложь;
			ФормаКонсоли.ПоложениеОкна = ВариантПоложенияОкна.Центрировать;
			ФормаКонсоли.РежимВнешнейОбработки = Ложь;
			ФормаКонсоли.РазрешитьСостояниеСвободное = Ложь;
			ФормаКонсоли.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
			
			ФормаКонсоли.ОткрытьМодально();
			
			Если ЗначениеЗаполнено(ФормаКонсоли.РезультатФормы) Тогда
				ВнутренниеПараметры = ФормаКонсоли.РезультатФормы.Параметры.Скопировать(Новый Структура("Вход, Фиксированный", Истина, Ложь), "Имя, Значение");
				Если Истина
					И ВнутренниеПараметры.Количество() = 0
					И Не ЗначениеЗаполнено(ФормаКонсоли.РезультатФормы.Текст)
					Тогда
					СтруктураАлгоритма = Неопределено;
				Иначе
					СтруктураАлгоритма = Новый Структура("ТекстАлгоритма, ВнутренниеПараметры", ФормаКонсоли.РезультатФормы.Текст, ВнутренниеПараметры);
					Алгоритм = Алгоритм.ПолучитьОбъект();
					Алгоритм.ТекстАлгоритма = ФормаКонсоли.РезультатФормы.Текст;
					Алгоритм.Параметры.Загрузить(ВнутренниеПараметры);
					Алгоритм.Записать();
					
					ФормаКонсоли=Неопределено;
				КонецЕсли;	
			КонецЕсли;
			Исключение
				РазблокироватьДанныеДляРедактирования(Алгоритм.Ссылка);
				Алгоритм = Неопределено;
				ВызватьИсключение;
			КонецПопытки;
			РазблокироватьДанныеДляРедактирования(Алгоритм.Ссылка);
			Алгоритм = Неопределено;
			
		#КонецЕсли
	КонецПроцедуры
