// Не рекомендуется использовать в часто выполняющемся коде
// Идея https://infostart.ru/1c/articles/2639512

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

Перем Результат Экспорт; // Произвольный - результат последнего вызова
Перем мОбъект; // Произвольный
Перем мИмяФункции; // Строка
Перем мПараметрыКонструктора; // Массив
Перем мМаксИндексПараметра; // Число

Функция Создать(Знач Объект, Знач ИмяФункции, П0 = Null, П1 = Null, П2 = Null, П3 = Null, П4 = Null, П5 = Null, П6 = Null, П7 = Null, П8 = Null, П9 = Null) Экспорт
	мОбъект = Объект;
	мИмяФункции = ИмяФункции;
	мПараметрыКонструктора = Новый Массив(мМаксИндексПараметра + 1);
	мПараметрыКонструктора[0] = П0;
	мПараметрыКонструктора[1] = П1;
	мПараметрыКонструктора[2] = П2;
	мПараметрыКонструктора[3] = П3;
	мПараметрыКонструктора[4] = П4;
	мПараметрыКонструктора[5] = П5;
	мПараметрыКонструктора[6] = П6;
	мПараметрыКонструктора[7] = П7;
	мПараметрыКонструктора[8] = П8;
	мПараметрыКонструктора[9] = П9;
	Возврат ЭтотОбъект;
КонецФункции

// Выходные значения параметров не возвращаются напрямую. Для этого нужно вызывать 
Функция Вызвать(П0 = Null, П1 = Null, П2 = Null, П3 = Null, П4 = Null, П5 = Null, П6 = Null, П7 = Null, П8 = Null, П9 = Null) Экспорт
	ПараметрыВызова = Новый Массив(мМаксИндексПараметра + 1);
	ПараметрыВызова[0] = П0;
	ПараметрыВызова[1] = П1;
	ПараметрыВызова[2] = П2;
	ПараметрыВызова[3] = П3;
	ПараметрыВызова[4] = П4;
	ПараметрыВызова[5] = П5;
	ПараметрыВызова[6] = П6;
	ПараметрыВызова[7] = П7;
	ПараметрыВызова[8] = П8;
	ПараметрыВызова[9] = П9;
	ТекстПаметров = "";
	Запятые = "";
	Для Н = 0 По мМаксИндексПараметра Цикл
		Если ПараметрыВызова[Н] <> Null Тогда
			ТекстПаметров = ТекстПаметров + Запятые + "П" + Н;
			Запятые = ",";
		ИначеЕсли мПараметрыКонструктора[Н] <> Null Тогда
			ТекстПаметров = ТекстПаметров + Запятые + "мПараметрыКонструктора[" + Н + "]";
			Запятые = ",";
		Иначе
			Запятые = Запятые + ",";
		КонецЕсли;
	КонецЦикла;
	Вызов = "мОбъект." + мИмяФункции + "(" + ТекстПаметров + ")";
	Результат = Вычислить(Вызов);
	Возврат Результат;
КонецФункции

// Выходное значение параметра по индексу.
Функция Параметр(Знач Индекс) Экспорт
	Возврат мПараметрыКонструктора[Индекс];
КонецФункции

/////////////////// Пример

Функция Главный()
	// Тестовые данные
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Сумма");  // Число - неотрицательное
	Дерево.Колонки.Добавить("Пометка");
	Корневая = Дерево.Строки.Добавить();
	Корневая.Сумма = 1;
	Дочерняя = Корневая.Строки.добавить();
	Дочерняя.Сумма = 3;
	Дочерняя.Пометка = Истина;
	Корневая.Строки.добавить().Сумма = 2;
	
	// Тест
	Максимум = МаксимумПоКолонке(Дерево, "Сумма");
	Помеченные = ПомеченныеУзлы(Дерево);
КонецФункции

Функция МаксимумПоКолонке(Дерево, ИмяСвойства) Экспорт
	Функтор = НовыйФунктор(ЭтотОбъект, "ДействиеМаксимумПоСвойству",, ИмяСвойства, 0);
	Возврат ОбходДерева(Дерево, Функтор).Результат;
КонецФункции

Функция ПомеченныеУзлы(Дерево) Экспорт
	Функтор = НовыйФунктор(ЭтотОбъект, "ДействиеПомеченныеУзлы",, Новый Массив);
	Возврат ОбходДерева(Дерево, Функтор).Результат;
КонецФункции
	
// Функторы

Функция ДействиеМаксимумПоСвойству(Строка, ИмяСвойства, Максимум) Экспорт
	Максимум = Макс(Строка[ИмяСвойства], Максимум);
	Возврат Максимум;
КонецФункции  

Функция ДействиеПомеченныеУзлы(Строка, Помеченные) Экспорт
	Если Строка.Пометка = Истина Тогда
		Помеченные.Добавить(Строка);
	КонецЕсли;
	Возврат Помеченные;
КонецФункции

// Служебные

Функция ОбходДерева(Узел, Функтор)
	Для каждого Строка Из Узел.Строки Цикл
		Функтор.Вызвать(Строка);
		ОбходДерева(Строка, Функтор);
	КонецЦикла;
	Возврат Функтор;
КонецФункции

Функция НовыйФунктор(Объект, ИмяФункции, _П0 = Null, _П1 = Null, _П2 = Null, _П3 = Null, _П4 = Null, _П5 = Null, _П6 = Null, _П7 = Null, _П8 = Null, _П9 = Null) Экспорт
	Возврат Обработки.ирФунктор.Создать().Создать(Объект, ИмяФункции, _П0, _П1, _П2, _П3, _П4, _П5, _П6, _П7, _П8, _П9);
КонецФункции


мМаксИндексПараметра = 9;

#КонецЕсли

