#Если Клиент Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция Компонента() Экспорт
	Возврат OPI_Компоненты.ПолучитьКомпоненту("ECIES");
КонецФункции

Функция Ключ() Экспорт
    Компонента = Компонента();
    Результат = Компонента.GenerateKeyPair();
	Если ЗначениеЗаполнено(Компонента.LastError) Тогда
		ВызватьИсключение Компонента.LastError;
	КонецЕсли;
	Возврат OPI_Инструменты.JsonВСтруктуру(Результат,Ложь);
КонецФункции

Функция Зашифровать(Текст,Ключ) Экспорт
    Компонента = Компонента();
    Результат = Компонента.Encrypt(Текст,Ключ);
	Если ЗначениеЗаполнено(Компонента.LastError) Тогда
		ВызватьИсключение Компонента.LastError;
	КонецЕсли;
    Возврат Результат;
КонецФункции

Функция ОшибкаПоследнейОперации(Компонента) Экспорт
	Возврат ?(ПустаяСтрока(Компонента.LastError),Неопределено,Компонента.LastError);
КонецФункции

Функция Base64UrlSafeWoPod_СтандартныйBase64(Base64UrlSafeWoPod) Экспорт
	Возврат СтрЗаменить(СтрЗаменить(Base64UrlSafeWoPod, "-", "+"), "_", "/") + "=";
КонецФункции

Функция СтандартныйBase64_Base64UrlSafeWoPod(СтандартныйBase64) Экспорт
	Возврат СтрРазделить(СтрЗаменить(СтрЗаменить(СтандартныйBase64, "+", "-"), "/", "_") , "=")[0];
КонецФункции

Функция Base64UrlSafeWoPod_ДвоичныеДанные(Base64UrlSafeWoPod) Экспорт
	Возврат ПолучитьДвоичныеДанныеИзBase64Строки(Base64UrlSafeWoPod_СтандартныйBase64(Base64UrlSafeWoPod));
КонецФункции

Функция Base64UrlSafeWoPod_ХранилищеЗначения(Base64UrlSafeWoPod) Экспорт
	Возврат Новый ХранилищеЗначения(Base64UrlSafeWoPod_ДвоичныеДанные(Base64UrlSafeWoPod), Новый СжатиеДанных(9));
КонецФункции

Функция ДвоичныеДанные_Base64(ДвоичныеДанные) Экспорт
	Возврат ПолучитьBase64СтрокуИзДвоичныхДанных(ДвоичныеДанные);
КонецФункции

Функция ДвоичныеДанные_Base64UrlSafeWoPod(ДвоичныеДанные) Экспорт
	Возврат OPI_Криптография.Base64UrlEncode(ДвоичныеДанные);
КонецФункции

Функция ХранилищеЗначения_Base64(ХранилищеЗначения) Экспорт
	Возврат ДвоичныеДанные_Base64(ХранилищеЗначения.Получить());
КонецФункции

Функция ХранилищеЗначения_Base64UrlSafeWoPod(ХранилищеЗначения) Экспорт
	Возврат ДвоичныеДанные_Base64UrlSafeWoPod(ХранилищеЗначения.Получить());
КонецФункции

#КонецОбласти

#КонецЕсли