&НаСервереБезКонтекста
Процедура ОбработкаОповещенияНаСервере(Ссылка,Секрет)
	Если Ложь Тогда Ссылка = Справочники.ЗашифрованныеДанные.ПустаяСсылка() КонецЕсли;
	ЗаблокироватьДанныеДляРедактирования(Ссылка);
	Элемент = Ссылка.ПолучитьОбъект();
	Элемент.Значение = Секрет;
	Элемент.Записать();
	РазблокироватьДанныеДляРедактирования(Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="Шифрование" И Источник = ЭтотОбъект Тогда
		ОбработкаОповещенияНаСервере(ЭтотОбъект.Элементы.Список.ТекущаяСтрока,Параметр);
		ОповеститьОбИзменении(ЭтотОбъект.Элементы.Список.ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры
