
Функция ПолучитьПараметрБлокировки()
	Перем Результат;
	Попытка
		Результат = ПрочитатьЗначениеJSON(ПолучитьБлокировкуСеансов().Параметр);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
	Если Не ТипЗнч(Результат) = Тип("Структура") Тогда Результат = Новый Структура КонецЕсли;
	Возврат Новый ФиксированнаяСтруктура(Результат);
КонецФункции

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	Если // это вызов при начале сеанса 
		ТребуемыеПараметры = Неопределено Тогда
		ПараметрыСеанса.РЦ_ЭтоФайлБаза = СтрНачинаетсяС(СтрокаСоединенияИнформационнойБазы(),"File");
		ПараметрыСеанса.РЦ_ПБ = ПолучитьПараметрБлокировки();
		ПараметрыСеанса.РЦ_ПБ.Свойство("РЦ_ПБ_ЭтоПродБаза", ПараметрыСеанса.РЦ_ПБ_ЭтоПродБаза);
	КонецЕсли;
КонецПроцедуры
