#Если Сервер Тогда
	
	Процедура УведомленияКлиентаПоОбъекту(Источник, Отказ, РежимПроведения=Неопределено)
		УведомленияКлиента.ОтправитьУведомление("ИзменениеОбъекта", Источник.Ссылка);
	КонецПроцедуры
	
	Процедура УведомленияКлиентаОбработкаПроведенияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
		УведомленияКлиентаПоОбъекту(Источник, Отказ);
	КонецПроцедуры
	
	Процедура УведомленияКлиентаПриЗаписиДокумента(Источник, Отказ) Экспорт
		УведомленияКлиентаПоОбъекту(Источник, Отказ);
	КонецПроцедуры
	
#ИначеЕсли НЕ Сервер Тогда
	
	Процедура ПриИзменениеОбъекта(ДанныеСообщения, ДополнительныеПараметры = Неопределено) Экспорт
		ОповеститьОбИзменении(ДанныеСообщения);
	КонецПроцедуры
	
#КонецЕсли


