//#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Тогда
//	Функция ПолучитьТаблицуПараметровАлгоритма(Канал) Экспорт
//		
//		Запрос = Новый Запрос;
//		Запрос.Текст =             //|	Запрос.Параметр.ТипЗначения КАК ТипЗначения,

//		"ВЫБРАТЬ
//		|	Запрос.Параметр.Код КАК Имя,
//		|   НЕОПРЕДЕЛЕНО Как ТипЗначения,											
//		|	ВЫБОР
//		|		КОГДА Запрос.Значение ССЫЛКА Справочник.ЗашифрованныеДанные
//		|			ТОГДА ""{{"" + Запрос.Значение.Значение + ""}}""
//		|		ИНАЧЕ Запрос.Значение
//		|	КОНЕЦ КАК Значение,
//		|	Запрос.Параметр.Наименование КАК Комментарий,
//		|	НЕОПРЕДЕЛЕНО КАК ТаблицаТипов,
//		|	ИСТИНА КАК Вход,
//		|	ИСТИНА КАК Фиксированный
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		Параметры.Объект КАК Объект,
//		|		Параметры.Параметр КАК Параметр,
//		|		Параметры.Значение КАК Значение,
//		|		ЕСТЬNULL(АктивностьПараметров.Активно, ЛОЖЬ) КАК АктивностьПараметров,
//		|		ЕСТЬNULL(АктивностьЗначений.Активно, ИСТИНА) КАК АктивностьЗначений
//		|	ИЗ
//		|		(ВЫБРАТЬ
//		|			ЕСТЬNULL(ПараметрыКанала.Объект, ПараметрыПротокола.Объект) КАК Объект,
//		|			ЕСТЬNULL(ПараметрыКанала.Параметр, ПараметрыПротокола.Параметр) КАК Параметр
//		|		ИЗ
//		|			(ВЫБРАТЬ
//		|				Т.Объект КАК Объект,
//		|				Т.Параметр КАК Параметр
//		|			ИЗ
//		|				РегистрСведений.ЗначенияПараметровОтправкиУведомлений КАК Т
//		|			ГДЕ
//		|				Т.Объект = &Протокол) КАК ПараметрыПротокола
//		|				ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//		|					Т.Объект КАК Объект,
//		|					Т.Параметр КАК Параметр
//		|				ИЗ
//		|					РегистрСведений.ЗначенияПараметровОтправкиУведомлений КАК Т
//		|				ГДЕ
//		|					Т.Объект = &Канал) КАК ПараметрыКанала
//		|				ПО ПараметрыПротокола.Параметр = ПараметрыКанала.Параметр) КАК Выборка
//		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПараметровОтправкиУведомлений КАК Параметры
//		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасписаниеАктивностиОбъектов.СрезПоследних(&ТД, Объект В (&Протокол, &Канал)) КАК АктивностьПараметров
//		|				ПО Параметры.Объект = АктивностьПараметров.Объект
//		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасписаниеАктивностиОбъектов.СрезПоследних(&ТД, ) КАК АктивностьЗначений
//		|				ПО Параметры.Значение = АктивностьЗначений.Объект
//		|			ПО (ИСТИНА)
//		|				И Выборка.Объект = Параметры.Объект
//		|				И Выборка.Параметр = Параметры.Параметр) КАК Запрос
//		|ГДЕ
//		|	ИСТИНА
//		|	И Запрос.АктивностьПараметров
//		|	И Запрос.АктивностьЗначений";
//		
//		Запрос.УстановитьПараметр("ТД", ТекущаяДатаСеанса());
//		Запрос.УстановитьПараметр("Канал", Канал);
//		Запрос.УстановитьПараметр("Протокол", Канал.Владелец);
//		//ирОбщий.От(Запрос);
//	    //Результат = ирОбщий.СузитьТипыКолонокТаблицыБезПотериДанныхЛкс(Запрос.Выполнить().Выгрузить());
//		Возврат Запрос.Выполнить().Выгрузить();
//	КонецФункции
//#КонецЕсли