Функция ВыполнитьАлгоритм(АлгоритмОбъект) Экспорт
	ирОбщий.ТребоватьТипЛкс(АлгоритмОбъект,"Основание",Тип("СправочникОбъект.ирАлгоритмы"));
	Результат = ирОбщий.ВыполнитьАлгоритм(АлгоритмОбъект.ПолучитьТелоМетода(Ложь),АлгоритмОбъект,0);
	АлгоритмОбъект = Неопределено;
	Возврат Результат;
КонецФункции

Функция ПолучитьТаблицуПараметровАлгоримаФормированияСсылки(КаналСсылка) Экспорт
	ирОбщий.ТребоватьТипЛкс(КаналСсылка,"Основание",Тип("СправочникСсылка.КаналыОтправкиУведомлений"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Канал", КаналСсылка);
	Запрос.УстановитьПараметр("Протокол", Запрос.Параметры.Канал.Владелец);                 
	Запрос.УстановитьПараметр("Алгоритм", Запрос.Параметры.Протокол.АлгоритмФормированияСсылки);                 
	Запрос.УстановитьПараметр("ТД", ТекущаяДатаСеанса());
	
	Запрос.Текст =             //|	Запрос.Параметр.ТипЗначения КАК ТипЗначения,
	"ВЫБРАТЬ
	|	ИСТИНА КАК Вход,
	|	ЛОЖЬ КАК Выход,
	|	НЕОПРЕДЕЛЕНО КАК ДопустимыеТипы,
	|	ВЫБОР
	|		КОГДА Запрос.Значение ССЫЛКА Справочник.ЗашифрованныеДанные
	|			ТОГДА ""{{"" + Запрос.Значение.Значение + ""}}""
	|		ИНАЧЕ Запрос.Значение
	|	КОНЕЦ КАК Значение,
	|	НЕОПРЕДЕЛЕНО КАК ЗначениеХранилище,
	|	Запрос.Параметр.Код КАК Имя,
	|	ВЫБОР
	|		КОГДА Запрос.Значение ССЫЛКА Справочник.ЗашифрованныеДанные
	|			ТОГДА ТИПЗНАЧЕНИЯ("""")
	|		ИНАЧЕ ТИПЗНАЧЕНИЯ(Запрос.Значение)
	|	КОНЕЦ КАК ТипЗначения,
	|	Запрос.Параметр.Наименование КАК Комментарий,
	|	НЕОПРЕДЕЛЕНО КАК ТаблицаТипов,
	|	ИСТИНА КАК Фиксированный
	|ИЗ
	|	(ВЫБРАТЬ
	|		Параметры.Объект КАК Объект,
	|		Параметры.Параметр КАК Параметр,
	|		Параметры.Значение КАК Значение,
	|		ЕСТЬNULL(АктивностьПараметров.Активно, ЛОЖЬ) КАК АктивностьПараметров,
	|		ЕСТЬNULL(АктивностьЗначений.Активно, ИСТИНА) КАК АктивностьЗначений
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ЕСТЬNULL(ПараметрыКанала.Объект, ПараметрыПротокола.Объект) КАК Объект,
	|			ЕСТЬNULL(ПараметрыКанала.Параметр, ПараметрыПротокола.Параметр) КАК Параметр
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Т.Объект КАК Объект,
	|				Т.Параметр КАК Параметр
	|			ИЗ
	|				РегистрСведений.ЗначенияПараметровОтправкиУведомлений КАК Т
	|			ГДЕ
	|				Т.Объект = &Протокол) КАК ПараметрыПротокола
	|				ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					Т.Объект КАК Объект,
	|					Т.Параметр КАК Параметр
	|				ИЗ
	|					РегистрСведений.ЗначенияПараметровОтправкиУведомлений КАК Т
	|				ГДЕ
	|					Т.Объект = &Канал) КАК ПараметрыКанала
	|				ПО ПараметрыПротокола.Параметр = ПараметрыКанала.Параметр) КАК Выборка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПараметровОтправкиУведомлений КАК Параметры
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасписаниеАктивностиОбъектов.СрезПоследних(&ТД, Объект В (&Протокол, &Канал)) КАК АктивностьПараметров
	|				ПО Параметры.Объект = АктивностьПараметров.Объект
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасписаниеАктивностиОбъектов.СрезПоследних(&ТД, ) КАК АктивностьЗначений
	|				ПО Параметры.Значение = АктивностьЗначений.Объект
	|			ПО (ИСТИНА)
	|				И Выборка.Объект = Параметры.Объект
	|				И Выборка.Параметр = Параметры.Параметр) КАК Запрос
	|ГДЕ
	|	ИСТИНА
	|	И Запрос.АктивностьПараметров
	|	И Запрос.АктивностьЗначений
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Вход,
	|	Т.Выход,
	|	НЕОПРЕДЕЛЕНО,
	|	Т.Значение,
	|	Т.ЗначениеХранилище,
	|	Т.Имя,
	|	ТИПЗНАЧЕНИЯ(Т.Значение),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.ирАлгоритмы.Параметры КАК Т
	|ГДЕ
	|	Т.Ссылка = &Алгоритм";
	//ирОбщий.От(Запрос);
	Результат = Запрос.Выполнить().Выгрузить();
	Платформа = ирКэш.Получить();
	Если Ложь Тогда Платформа = Обработки.ирПлатформа.Создать()КонецЕсли;
	Для Каждого СтрокаРезультата Из Результат Цикл
		СтрокаРезультата.ТаблицаТипов = Платформа.ТаблицаТиповИзЗначения(СтрокаРезультата.Значение);
		СтрокаРезультата.ДопустимыеТипы = Платформа.ДопустимыеТипыИзТаблицыСтруктурТипа(СтрокаРезультата.ТаблицаТипов);
	КонецЦикла;
	Возврат Результат;	
КонецФункции	                       

Функция ПолучитьОбъектАлгорим(АлгоримСсылка,ТаблицаПараметров) Экспорт
	ирОбщий.ТребоватьТипЛкс(АлгоримСсылка,"Ссылка на алгорим",Тип("СправочникСсылка.ирАлгоритмы"));
	ирОбщий.ТребоватьТипЛкс(ТаблицаПараметров,"Таблица параметров алгоритма",Тип("ТаблицаЗначений"));
	Результат = АлгоримСсылка.ПолучитьОбъект();
	Результат.Параметры.Загрузить(ТаблицаПараметров);
	Возврат Результат;
КонецФункции

функция ВыполнитьАлгоримФормированияСсылки(КаналСсылка) Экспорт
	ирОбщий.ТребоватьТипЛкс(КаналСсылка,"Ссылка на канал",Тип("СправочникСсылка.КаналыОтправкиУведомлений"));
	Возврат ВыполнитьАлгоритм(ПолучитьОбъектАлгорим(КаналСсылка.Владелец.АлгоритмФормированияСсылки
	,ПолучитьТаблицуПараметровАлгоримаФормированияСсылки(КаналСсылка)));
КонецФункции
